app/controllers/articles_controller.rb

	def index
		@articles = Article.order("released_at DESC")
---
SELECT "articles".* FROM "articles" ORDER BY released_at DESC

	def create
		@article = Article.new(params[:article])
		if @article.save
---
INSERT INTO "articles" ("body", "created_at", "expired_at", "member_only", "released_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)