app/controllers/sessions_controller.rb

	def create
		auth = request.env["omniauth.auth"]
		user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 12 Jun 2014 14:52:38 UTC +00:00], ["name", "Negishi Yuki"], ["provider", "facebook"], ["uid", "1452691841646550"], ["updated_at", Thu, 12 Jun 2014 14:52:38 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."provider" = 'facebook' AND "users"."uid" = '1452691841646550' LIMIT 1